resource/request_file/NewIndia_Car_Premium.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body xmlns:typ="http://iims.services/types/">
        <typ:calculatePremiumMasterElement>
            <typ:userCode>___insurer_integration_agent_code___</typ:userCode>
            <typ:rolecode>SUPERUSER</typ:rolecode>
            <typ:PRetCode>0</typ:PRetCode>
            <typ:userId>POLICYBOSS</typ:userId>
            <typ:stakeCode>BROKER</typ:stakeCode>
            <typ:roleId />
            <typ:userroleId />
            <typ:branchcode />
            <typ:PRetErr />
            <typ:polBranchCode />
            <typ:productName>___product_id_5___</typ:productName>
            <typ:policyHoldercode>___product_id_2___</typ:policyHoldercode>
            <typ:eventDate>___current_date___</typ:eventDate>
            <typ:netPremium />
            <typ:termUnit>G</typ:termUnit>
            <typ:grossPremium />
            <typ:policyType />
            <typ:polInceptiondate>___policy_start_date___</typ:polInceptiondate>
            <typ:polStartdate>___policy_start_date___</typ:polStartdate>
            <typ:polExpirydate>___policy_end_date___</typ:polExpirydate>
            <typ:branchCode />
            <typ:term>1</typ:term>
            <typ:polEventEffectiveEndDate />
            <typ:productCode>___product_id_3___</typ:productCode>
            <typ:policyHolderName>SRIKANT GAUTAM</typ:policyHolderName>
            <typ:productId>___product_id_4___</typ:productId>
            <typ:serviceTax />
            <typ:status />
            <typ:cbDetails />
            <typ:sumInsured />
            <typ:updateDate />
            <typ:policyId />
            <typ:polDetailLastUpdateDate />
            <typ:quoteNo />
            <typ:policyNo />
            <typ:policyDetailid />
            <typ:documentLink />
            <typ:polLastUpdateDate />
            <typ:properties>
                <typ:value>PolicyBoss</typ:value>
                <typ:name>channelcode</typ:name>
            </typ:properties>
            <typ:risks>
                <typ:riskCode>VEHICLE</typ:riskCode>
                <typ:riskSuminsured>0</typ:riskSuminsured>
                <typ:covers>
                    <typ:productCode>___product_id_3___</typ:productCode>
                    <typ:policyDetailid />
                    <typ:coverCode>___addon_package_name___</typ:coverCode><!--EHMNTCOVERE/PACKAGE-->
                    <typ:productId />
                    <typ:coverExpiryDate />
                    <typ:properties>
                        <typ:value />
                        <typ:name />
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___product_id_6___</typ:value>
                        <typ:name>Sum Insured for PA to Owner Driver</typ:name>
                    </typ:properties>
					<typ:properties>
                        <typ:value>___pa_paid_driver_si_2___</typ:value>
                        <typ:name>Do you wish to include PA Cover for Paid Drivers</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>1</typ:value>
                        <typ:name>No of Paid Drivers</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___pa_paid_driver_si___</typ:value>
                        <typ:name>Individual SI for Paid Driver</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___pa_paid_driver_si___</typ:value>
                        <typ:name>Capital SI for Drivers</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___pa_unnamed_passenger_si_2___</typ:value>
                        <typ:name>Do you want to include PA cover for unnamed person</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___dbmaster_insurer_vehicle_seatingcapacity___</typ:value>
                        <typ:name>No of unnamed Persons</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___pa_unnamed_passenger_si___</typ:value>
                        <typ:name>Individual SI for unnamed Person</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___is_llpd___</typ:value>
                        <typ:name>LL to paid drivers,cleaner employed  for opn. and/or maint. of vehicle under WCA</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___is_llpd_2___</typ:value>
                        <typ:name>Number of Legal Liable Drivers</typ:name>
                    </typ:properties>
                    <!--cover start-->
                    <typ:properties>
                        <typ:value>N</typ:value>
                        <typ:name>LL to Employees of Insured traveling and / or driving the Vehicle</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>0</typ:value>
                        <typ:name>Number Of Legal Liable Employees</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>0</typ:value>
                        <typ:name>Sum Insured for TPPD</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>A</typ:value>
                        <typ:name>Type of Liability Coverage</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>No</typ:value>
                        <typ:name>Additional towing charges cover</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>10000</typ:value>
                        <typ:name>Additional towing charges Amount</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___addon_engine_protector_cover___</typ:value>
                        <typ:name>Engine protect cover</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>No</typ:value>
                        <typ:name>Inclusion of road tax Cover</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>No</typ:value>
                        <typ:name>Loss of content cover</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>20000</typ:value>
                        <typ:name>Loss of content Amount</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___addon_ncb_protection_cover___</typ:value>
                        <typ:name>NCB Protection Cover</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___addon_zero_dep_cover___</typ:value>
                        <typ:name>Nil depreciation</typ:name>
                    </typ:properties>
                    <typ:properties>
                        <typ:value>___addon_invoice_price_cover___</typ:value>
                        <typ:name>Return to invoice cover</typ:name>
                    </typ:properties>
                    <!--cover end-->               
                </typ:covers>
                <typ:properties>
                    <typ:value>___vehicle_insurance_type___</typ:value>
                    <typ:name>New Vehicle</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___vehicle_manf_year___</typ:value>
                    <typ:name>Year of Manufacture</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___registration_no_1___</typ:value> 
                    <typ:name>Registration No (1)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___registration_no_2___</typ:value> 
                    <typ:name>Registration No (2)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___registration_no_3___</typ:value>
                    <typ:name>Registration No (3)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___registration_no_4___</typ:value>
                    <typ:name>Registration No (4)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___vehicle_registration_date___</typ:value>
                    <typ:name>Date of Sale</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___vehicle_registration_date___</typ:value>
                    <typ:name>Date of Registration</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___dbmaster_insurer_vehicle_make_name___</typ:value>
                    <typ:name>Make</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___dbmaster_insurer_vehicle_model_name___</typ:value>
                    <typ:name>Model</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___dbmaster_insurer_vehicle_variant_name___</typ:value>
                    <typ:name>Variant</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>A</typ:value>  <!--doubt-->
                    <typ:name>Vehicle Zone for Private Car</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___dbmaster_insurer_vehicle_fueltype___</typ:value>
                    <typ:name>Type of Fuel</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___external_bifuel_value_2___</typ:value>
                    <typ:name>In Built Bi-fuel System fitted</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___external_bifuel_value___</typ:value>
                    <typ:name>Bi-fuel System Value</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___is_antitheft_fit___</typ:value>
                    <typ:name>Is the vehicle fitted with Anti-theft device</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>01/01/2029</typ:value>
                    <typ:name>Registration Validity Date</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>Mumbai West,Regional Transport Officer, 111-D, Ambiwali Village, Near Manish Nagar, Varsova Road, Andheri(W),  Mumbai - 400063</typ:value> 
                    <typ:name>Name and Address of Registration Authority</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___dbmaster_insurer_vehicle_seatingcapacity___</typ:value>
                    <typ:name>(*)Seating Capacity</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___dbmaster_insurer_vehicle_cubiccapacity___</typ:value>
                    <typ:name>(*)Cubic Capacity</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___dbmaster_insurer_vehicle_exshowroom___</typ:value>
                    <typ:name>Vehicle Invoice Value</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___vehicle_age_month___</typ:value> <!-- doubt -->
                    <typ:name>Vehicle Age in Months</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>N</typ:value>
                    <typ:name>Whether trailer attached to the vehicle</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Number of Trailers Attached</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Total IDV of the Trailer Attached</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___electrical_accessory_2___</typ:value>
                    <typ:name>Extra Electrical/ Electronic fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Value of Music System</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Value of AC/Fan</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Value of Lights</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___electrical_accessory___</typ:value>
                    <typ:name>Value of Other Fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___electrical_accessory___</typ:value>
                    <typ:name>Total Value of Extra Electrical/ Electronic fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___non_electrical_accessory_2___</typ:value>
                    <typ:name>Non-Electrical/ Electronic fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___non_electrical_accessory___</typ:value>
                    <typ:name>Value of Non- Electrical/ Electronic fittings</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Additional Towing Coverage Required</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Additional Towing Coverage Amount</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>Y</typ:value>
                    <typ:name>Do You Hold Valid Driving License</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>LMOTORVEH</typ:value>
                    <typ:name>License Type of Owner Driver</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___vehicle_expected_idv___</typ:value>
                    <typ:name>Insureds declared Value (IDV)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___nia_total_accessories___</typ:value><!-- doubt = electrical + nonelectrical + bifuel -->
                    <typ:name>IDV of Accessories</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___vehicle_expected_idv___</typ:value><!-- ___nia_total_idv___ doubt = IDV + electrical + nonelectrical + bifuel -->
                    <typ:name>Total IDV</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___vehicle_ncb_next___</typ:value>
                    <typ:name>NCB Applicable Percentage</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___dbmaster_insurername___</typ:value> <!-- doubt -->
                    <typ:name>Name of Previous Insurer</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>NA</typ:value>  <!-- doubt -->
                    <typ:name>Previous Policy Number</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>NA</typ:value> <!-- doubt -->
                    <typ:name>Address of the Previous Insurer</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___policy_expiry_date___</typ:value>  <!-- (CarType =="Y"?"01/01/0001":PreviousPolicyEndDate ) -->
                    <typ:name>Expiry date of previous Policy</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___nia_policy_excess___</typ:value> <!-- CubicCapacity < 1500) ? 1000 : 2000 -->
                    <typ:name>Policy Excess (Rs)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Imposed Excess (Rs)</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>___voluntary_deductible___</typ:value>
                    <typ:name>Voluntary Excess for PC</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>0</typ:value>
                    <typ:name>Loading amount for OD</typ:name>
                </typ:properties>
                <typ:properties>
                    <typ:value>60</typ:value>  <!-- doubt -->
                    <typ:name>OD discount (%)</typ:name>
                </typ:properties>
            </typ:risks>
        </typ:calculatePremiumMasterElement>
    </soapenv:Body>
</soapenv:Envelope>